# ---------------------------------------------------------
#w 10. المكتبات - Libraries 
# ---------------------------------------------------------

#y --- الجزء الأول: مكتبة العشوائية (import random) ---
import random  

#g 1. توليد رقم صحيح عشوائي بين (a, b) شامل الطرفين
print(random.randint(1, 10)) 

#g 2. توليد رقم عشري عشوائي بين 0 و 1 
print(random.random()) 

#g 3. اختيار عنصر واحد عشوائي من قائمة 
options = ["Red", "Green", "Blue"] 
print(random.choice(options)) 


#y --- الجزء الثاني: مكتبة الرياضيات (import math) ---
import math 
#g 1. حساب الكوساين (Cosine)
print(math.cos(0))        # cos(0) = 1

#g 2. حساب الجيب (Sine)
print(math.sin(0))  # = 0

#g 3. حساب الجذر التربيعي
print(math.sqrt(25))  # = 5 


# ---------------------------------------------------------
# ملاحظة (موجودة في المخطط):
# import نستخدم  في بداية الملف لاستدعاء أي مكتبة نريد العمل بها.
# ---------------------------------------------------------