# ---------------------------------------------------------
#w 04. مدخلات المستخدم - User Input 
# ---------------------------------------------------------

#g 1. Input طريقة استخدام دالة  
input() # Enter البرنامج سيتوقف وينتظر المستخدم يكتب شي ويضغط  

#g 2. حفظ المدخل في متغير 
name = input("Enter your name: ") 
print("Welcome", name) 

# ---------------------------------------------------------
# أي شيء يدخله المستخدم يتم تخزينه كـ نص 
# ---------------------------------------------------------