# ---------------------------------------------------------
#w 08. الحلقات التكرارية - Loops (Iterative) 
# ---------------------------------------------------------

#g 1. التكرار على العناصر - For Iterable 
# نستخدمها مع القوائم أو النصوص 

List = [1, 2, 3, 4, 5]
for i in List: 
    print(i) 


 

#g 2. التكرار باستخدام المدى - For Range 
# ملاحظة: الرقم الأخير في الدالة دائما غير شامل.

#o من 0 إلى 100 (بداية من 0، والنهاية 101 غير شاملة)
for i in range(101): 
    print(i) 

#o (بداية من 1، والنهاية 101 غير شاملة) من 1 إلى 100 
for i in range(1, 101): 
    print(i)

#o (1, 3, 5...) من 1 إلى 100، ويقفز في كل مرة خطوتين 
for i in range(1, 101, 2): 
    print(i) 




#g 3. حلقة While (تستمر ما دام الشرط صحيحاً) 
count = 0 
while count < 5 : 
    print("Counter is:", count) 
    count += 1 # تحديث المتغير حتى لا تصبح الحلقة لانهائية 




#Y التحكم في الحلقة (break & continue)
for n in range(10):
    if n == 3:
        continue # تخطي الرقم 3 وتكمل الباقي
    if n == 7:
        break    # إيقاف الحلقة تماماً عند الوصول للرقم 7
    print("Number:", n) 


# ---------------------------------------------------------
# ملاحظة
# المتغير يجب أن يكون نوعاً قابلاً للتكرار 
# For Iterable:  (List) أو  (String) أو  (Tuple)
# # ---------------------------------------------------------