#include <iostream>
using namespace std;

////-------------------------------------------------------------------------------------------------------------
//? 1- بدون نوع ارجاع وبدون Parameters
void hi()
{
    cout << "Hello" << endl;
}

////-------------------------------------------------------------------------------------------------------------
//? 2- بدون نوع ارجاع وبها Parameters
void sum1(int a, int b)
{
    cout << a + b << endl;
}

////-------------------------------------------------------------------------------------------------------------
//? 3- بها نوع ارجاع وبدون Parameters
int number()
{
    return 10;
}

////-------------------------------------------------------------------------------------------------------------
//? 4- بها نوع ارجاع وبها Parameters
int sum2(int a, int b)
{
    return a + b;
}

////-------------------------------------------------------------------------------------------------------------
//? pass by value
void increment1(int x)
{
    x++;
}

//? pass by reference
void increment2(int &x)
{
    x++;
}

////-------------------------------------------------------------------------------------------------------------
//? recursion
int fact(int n)
{
    if (n == 0) return 1;
    return n * fact(n - 1);
}

////-------------------------------------------------------------------------------------------------------------
int globalNumber = 5; // Global scope

int main()
{
    int localNumber = 10; // Function scope

    hi();
    sum1(4,6);
    cout << number() << endl;
    cout << sum2(4,6) << endl;
    cout << fact(5) << endl;
}
