# ---------------------------------------------------------
#w 02. أنواع المتغيرات - Variable Types 
# ---------------------------------------------------------

#g 1. الأرقام (Numbers)
# تشمل الأعداد الصحيحة والأعداد العشرية 
age = 25          # Integer (int)
price = 5.99      # Floating point (float)

#g 2. النصوص (String)
# "" أي نص يوضع بين علامات تنصيص
name = "Ali"      # String (str)

#g 3. القيم المنطقية (Boolean)
# تأخذ قيمتين فقط: صح أو خطأ (لاحظ الحرف الأول كابيتال)
is_T = True  
is_F = False 

#g 4. القوائم (List)
# [ ] تستخدم لتخزين مجموعة قيم (عادي مختلفة النوع) في متغير واحد، وتكون داخل أقواس مربعة 
fruits = ["Apple", "Banana", 5]  # القائمة يمكن تعديلها (Mutable) و
#o نصل للعناصر عن طريق الإندكس 

#g 5. التبل (Tuple)
# ( ) تشبه القائمة لكن لا يمكن تعديلها بعد الإنشاء، وتكون داخل أقواس دائرية 
coordinates = (10, 20) # القائمة لا يمكن تعديلها 

#g 6. القواميس (Dictionary)
# { } تخزن البيانات على شكل (مفتاح : قيمة) داخل أقواس معرّجة 
user_data = {"id": 1, "username": "X7do0"} 
#o نصل للعناصر عن طريق المفتاح 

#y 7. المجموعات (Set)
# لا تسمح بتكرار العناصر، أيضا تستخدم الأقواس المعرّجة، تخزن مجموعة قيم فقط بدون مفاتيح 
numbers_set = {1, 2, 3, 3, 4}  #y فقط للاطلاع حالياً وليست مطلوبة في هذا المستوى


#W بايثون لغة ديناميكية (Dynamic Typing):
#W بايثون يعرف النوع تلقائياً من القيمة.
x = 10    # هنا x هو رقم
x = "Ten" # عادي جداً تغيره إلى نص بنفس الكود