# ---------------------------------------------------------
#w 05. تحويل الأنواع - Type Casting 
# ---------------------------------------------------------

#g 1. الدوال الأساسية للتحويل
#o str()   -> تحول القيمة إلى نص
#o int()   -> تحول القيمة إلى عدد صحيح
#o float() -> تحول القيمة إلى عدد عشري

x = "10"       # هذا نص (String) لأن فيه علامات تنصيص
y = int(x)     # تحول من نص إلى رقم صحيح: 10
z = float(y)   # تحول من نص إلى رقم عشري: 10.0
w = str(z)     
# ---------------------------------------------------------
# ملاحظة مهمة (تحذير):
# لا يمكن تحويل نص أبجدي إلى رقم، سيظهر لك خطأ (ValueError)
# مثال: int("Hello") <-- هذا يسبب خطأ لأن الكلمة ليست أرقاماً
# ---------------------------------------------------------

#g 2. معرفة نوع المتغير وعدد العناصر
text = "Python"

x = type(text) #o 1) type(x): تعطينا نوع المتغير الحالي
y = len(text)  #o 2) len(x): تعطينا طول النص أو عدد عناصر القائمة

print(x)  
print(y)  


# ---------------------------------------------------------