# ---------------------------------------------------------
#w 03. العمليات الحسابية - Operators 
# ---------------------------------------------------------

#g 1. العمليات الحسابية الأساسية
print(10 + 5)  # ناتج جمع 
print(10 - 5)  # ناتج طرح 
print(10 * 5)  # ناتج ضرب 
print(10 / 3)  # ناتج قسمة  #O دائما الناتج رقم عشري 

print(2 ** 3)  # ناتج أس 
print(10 // 3) # ناتج قسمة بدون باقي 
print(10 % 3)  # ناتج باقي بدون قسمة 


#g 2. العمليات المركبة 
# تستخدم لتحديث قيمة المتغير بناءً على قيمته القديمة بشكل مختصر 
score = 10 

score += 5   # هي نفسها score = score + 5 (الناتج: 15) 
score -= 2   # هي نفسها score = score - 2 (الناتج: 13) 
score *= 2   # هي نفسها score = score * 2 (الناتج: 26) 
score /= 2   # هي نفسها score = score / 2 (الناتج: 13.0) 
score %= 3   # هي نفسها score = score % 3 (الناتج: 1.0) 

print("Final Score:", score) 


#g 3. عمليات المقارنة
print(10 > 5)   # هل اكبر من ؟
print(10 < 5)   # هل اصغر من ؟

print(10 >= 10) # اكبر من أو يساوي ؟
print(10 <= 7)  # اصغر من أو يساوي ؟

print(10 == 10) # هل يساوي ؟
print(10 != 8)  # هل لا يساوي ؟ 


#g 4. البوابات المنطقية (Logical Operators)
print((10>5) and (0<1))  # هل كلاهما صح ؟ 
print((10>5) or  (0<1))  # هل أحدهما صح ؟ 
print(not (10==8))     # هل النتيجة غير صحيحة؟