# ---------------------------------------------------------
#w 12. القواميس والمجموعات - Dictionaries & Sets 
# ---------------------------------------------------------

#y --- الجزء الأول: القواميس (Dictionaries) ---
#g القاموس: يخزن البيانات بشكل (key : value)

# إنشاء قاموس
student = {
   "name": "Ali",
    "age": 21,
    "grade": "A"
}

print(student)

#g 1. الوصول إلى القيم باستخدام key
print(student["name"])

#g 2. استخدام get (أكثر أمان)
print(student.get("age")) 

#g 3. pop حذف عنصر باستخدام 
student.pop("grade") 
print(student) 

#g 4. del حذف عنصر باستخدام 
del student["age"] 
print(student)


#y --- الجزء الثاني: المجموعات (Sets) ---
#g set: مجموعة عناصر غير مرتبة ولا تحتوي على تكرار

# إنشاء set
a = {1, 2, 3, 4}
b = {3, 4, 5, 6}

print(a)
print(b)

#g 1. إضافة عنصر (add)
a.add(10)
print(a)

#g 2. حذف عنصر (remove)
a.remove(2)
print(a)

#g 3. اتحاد المجموعتين (a | b)
print(a | b) 

#g 4. تقاطع المجموعتين (a & b)
print(a & b) 

#g 5. الفرق بين المجموعتين (a - b)
print(a - b)

# ---------------------------------------------------------
#. ملاحظات (موجودة في المخطط):
#. Dictionary: يخزن البيانات على شكل key:value
#. get: يمنع حدوث خطأ إذا المفتاح غير موجود
#. Set: لا يقبل التكرار وعناصره غير مرتبة
#. اتحاد، & تقاطع، - فرق بين المجموعات|  
# ---------------------------------------------------------