# ---------------------------------------------------------
#w 06. دمج الدوال - Composition (Function Nesting) 
# ---------------------------------------------------------

# الفكرة: تنفيذ أكثر من دالة في سطر واحد
# التنفيذ يبدأ دائماً من الدالة "الداخلية" وصولاً إلى "الخارجية" الخ

#g 1. المثال الكلاسيكي (تحويل المدخلات مباشرة)
age = int(input("Enter your age: ")) 
# أولاًinput هنا بايثون سينفذ
# int ثم يحول النتيجة إلى  
 
#g 2. دمج عدة دوال (Nesting Multiple Functions)
x = 123.45 

# نريد: تحويله لنص، ثم حساب طوله، ثم طباعة الناتج
# السطر القادم يقرأ من الداخل للخارج
# 1. str(x) -> "يحول الرقم لنص "123.45
# 2. len(...) -> يحسب عدد الحروف (6 حروف مع النقطة)
# 3. print(...) -> يطبع النتيجة النهائية

print(len(str(x))) 
print(len(str(x)))