#include <iostream>
using namespace std;

int main()
{
    int x = 10;
    int *px = &x;

    cout << "x   = " << x   << endl; // قيمة المتغير
    cout << "&x  = " << &x  << endl; // عنوان المتغير
    cout << "px  = " << px  << endl; // قيمة المؤشر هي عنوان المتغير
    cout << "*px = " << *px << endl; // قيمة المتغير المؤشر عليه

    ////-------------------------------------------------------------------------------------------------------------
    //? Reference
    int &b = x;
    b = 20;
    cout << x << endl;

    ////-------------------------------------------------------------------------------------------------------------
    //? const pointers
    int y = 30;
    const int *p1 = &x;       // القيمة ثابتة
    int *const p2 = &x;       // العنوان ثابت
    const int *const p3 = &y; // القيمة والعنوان ثابتان

    ////-------------------------------------------------------------------------------------------------------------
    //? pointer with array
    int v[5] = {10,20,30,40,50};
    int *ptr = v;

    for (int i = 0; i < 5; i++)
    {
        cout << *ptr << " ";
        ptr++;
    }
}
